shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/ble/profile/server/dfu_service.c
    if (buffer_check_size > DFU_TEMP_BUFFER_SIZE)
    {
        //invalid para
        DFU_PRINT_ERROR3("<==dfu_buffer_check_process: invalid buffer_check_size=%d(>%d), cur_offset=%d",
                         buffer_check_size, DFU_TEMP_BUFFER_SIZE, g_dfu_para.cur_offset);
        g_ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    if (g_ota_tmp_buf_used_size == buffer_check_size ||
        g_dfu_para.cur_offset + g_ota_tmp_buf_used_size == g_dfu_para.image_total_length)
    {
        if (dfu_check_buf_crc(p_ota_temp_buffer_head, g_ota_tmp_buf_used_size, buffer_crc))
        {
            //crc error
            DFU_PRINT_ERROR1("<==dfu_buffer_check_process: Buf CRC Error! cur_offset=%d",
                             g_dfu_para.cur_offset);
            g_ota_tmp_buf_used_size = 0;
            notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
            LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
            return;
        }

        else //crc ok
        {
            //1. devrypt data
            if (OTP->ota_with_encryption_data)
            {
                dfu_hw_aes_decrypt_image(p_ota_temp_buffer_head, p_ota_temp_buffer_head, g_ota_tmp_buf_used_size);
            }
            //2. write flash
            uint32_t result = dfu_update(g_dfu_para.ctrl_header.image_id,
                                         g_dfu_para.cur_offset + temp_image_info[temp_image_num].image_offset,
                                         g_ota_tmp_buf_used_size, (uint32_t *)p_ota_temp_buffer_head, false);

            if (result == 0)
            {
                uint32_t updated_success_len = g_ota_tmp_buf_used_size;
                callback_data.msg_data.write.opcode = DFU_WRITE_DOING;
                callback_data.msg_data.write.length = 4;
                callback_data.msg_data.write.p_value = (uint8_t *)&updated_success_len;
                if (pfn_dfu_service_cb)
                {
                    T_APP_RESULT w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                    if (w_cause != APP_RESULT_SUCCESS)
                    {
                        return;
                    }
                }

                g_dfu_para.cur_offset += g_ota_tmp_buf_used_size;

                if ((g_dfu_para.cur_offset - dfu_resend_offset) >= FMC_SEC_SECTION_LEN)
                {
                    dfu_resend_offset += FMC_SEC_SECTION_LEN;
                }
                g_ota_tmp_buf_used_size = 0;
                DFU_PRINT_INFO2("<==dfu_buffer_check_process: dfu_update Success! cur_offset=%d, dfu_resend_offset=%d",
                                g_dfu_para.cur_offset, dfu_resend_offset);
                notif_data[2] = DFU_ARV_SUCCESS; //valid
                LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
            else
            {
                DFU_PRINT_ERROR1("<==dfu_buffer_check_process: dfu_update Fail result=%d", result);

                result = dfu_flash_erase_sector_with_retry(g_dfu_para.ctrl_header.image_id, dfu_resend_offset);
                if (result)
                {
                    //erase fail
                    g_ota_tmp_buf_used_size = 0;
                    g_dfu_para.cur_offset = dfu_resend_offset;
                    DFU_PRINT_ERROR1("<==dfu_buffer_check_process: erase flash fail 3 times! cur_offset=%d",
                                     g_dfu_para.cur_offset);

                    notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                    LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                    return;
                }

                if ((g_dfu_para.cur_offset - dfu_resend_offset) > FMC_SEC_SECTION_LEN) //need erase two sector
                {
                    DFU_PRINT_INFO0("<==dfu_buffer_check_process:Need erase two sectors");
                    result = dfu_flash_erase_sector_with_retry(g_dfu_para.ctrl_header.image_id,
                                                               dfu_resend_offset + FMC_SEC_SECTION_LEN);
                    if (result)
                    {
                        //erase fail
                        g_ota_tmp_buf_used_size = 0;
                        g_dfu_para.cur_offset =  dfu_resend_offset;
                        DFU_PRINT_ERROR1("<==dfu_buffer_check_process: erase flash fail 3 times! cur_offset=%d",
                                         g_dfu_para.cur_offset);

                        notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                        return;
                    }

                }
                //erase ok
                g_ota_tmp_buf_used_size = 0;
                g_dfu_para.cur_offset =  dfu_resend_offset;
                DFU_PRINT_INFO1("<==dfu_buffer_check_process: erase ok! cur_offset=%d", g_dfu_para.cur_offset);
                notif_data[2] = DFU_ARV_FAIL_PROG_ERROR;
                LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
        }
    }
    else
    {
        DFU_PRINT_ERROR4("<==dfu_buffer_check_process: Error buffer_check_size=%d,buf_used_size=%d,cur_offset=%d,image_total_length=%d",
                         buffer_check_size, g_ota_tmp_buf_used_size,
                         g_dfu_para.cur_offset, g_dfu_para.image_total_length);
        //flush buffer.
        g_ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&notif_data[3], g_dfu_para.cur_offset);
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_REPORT_BUFFER_CRC, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
}

void dfu_notify_conn_para_update_req(uint8_t conn_id, T_DFU_ARV_ERROR_CODE error_code)
{
    if (g_dfu_para.dfu_conn_para_update_in_progress == true)
    {
        g_dfu_para.dfu_conn_para_update_in_progress = false;
        uint8_t notif_data[3] = {0};
        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = DFU_OPCODE_CONN_PARA_TO_UPDATE_REQ;
        notif_data[2] = error_code;

        DFU_PRINT_INFO1("<==dfu_notify_conn_para_update_req error_code=0x%x", error_code);
        /* Connection Param Update rejected, we should notify the fail result to remote device. */
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_CONN_PARA_UPDATE_REQ, GATT_PDU_TYPE_NOTIFICATION);
    }
}

void dfu_service_handle_valid_fw(uint8_t conn_id)
{
    uint8_t notif_data[DFU_NOTIFY_LENGTH_VALID_FW] = {0};
    bool check_result = false;
    bool is_enable_bank_switch = is_ota_support_bank_switch();

