shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/ble/profile/server/dfu_service.c
    if (is_enable_bank_switch)
    {
        check_result = dfu_check_checksum(g_dfu_para.ctrl_header.image_id, 0);
    }
    else
    {
        check_result = dfu_check_checksum(temp_image_info[temp_image_num].image_id,
                                          temp_image_info[temp_image_num].image_offset);
    }
    DFU_PRINT_INFO1("dfu_service_handle_valid_fw: check_result=%d (1: Success, 0: Fail)", check_result);

    if (check_result)
    {
        if (!is_enable_bank_switch)
        {
            temp_image_num ++;
            DFU_PRINT_INFO1("DFU_OPCODE_VALID_FW: temp_image_num=%d ", temp_image_num);
        }

        notif_data[2] = DFU_ARV_SUCCESS;
    }
    else
    {
        notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
    }
    notif_data[0] = DFU_OPCODE_NOTIFICATION;
    notif_data[1] = DFU_OPCODE_VALID_FW;
    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                     notif_data, DFU_NOTIFY_LENGTH_VALID_FW, GATT_PDU_TYPE_NOTIFICATION);
}


void dfu_service_handle_active_image(void)
{
    if (!is_ota_support_bank_switch())
    {
        uint32_t base_addr = 0;
        T_IMG_CTRL_HEADER_FORMAT *p_header = NULL;
        if (IMAGE_USER_DATA == g_dfu_para.ctrl_header.image_id)
        {
            /* because flash_get_bank_addr(FLASH_BKP_DATA1) is not located flash block protect range, needn't unlock bp */
            base_addr = flash_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE;
        }
        else
        {
            /* check OTA temp or running bank to see if received image is OK.*/
            base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)g_dfu_para.ctrl_header.image_id);
        }

        for (uint8_t i = 0; i < temp_image_num; i++)
        {
            p_header = (T_IMG_CTRL_HEADER_FORMAT *)(base_addr + temp_image_info[i].image_offset);
            dfu_set_image_ready(p_header);
        }
    }

}

/**
 * @brief dfu_service_handle_control_point_req
 *
 * @param length     control point cmd length.
 * @param p_value    control point cmd address..
 * @return None
*/
void dfu_service_handle_control_point_req(uint8_t conn_id, uint16_t length,
                                          uint8_t *p_value)
{
    T_APP_RESULT w_cause = APP_RESULT_SUCCESS;
    T_DFU_CTRL_POINT dfu_control_point;
    uint8_t *p = p_value + 1;
    uint8_t notif_data[DFU_NOTIFY_LENGTH_MAX] = {0};

    T_DFU_CALLBACK_DATA callback_data;
    callback_data.conn_id = conn_id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = INDEX_DFU_CONTROL_POINT_CHAR_VALUE;

    dfu_control_point.opcode = *p_value;
    DFU_PRINT_TRACE2("==>dfu_service_handle_control_point_req: opcode=0x%x, length=%d",
                     dfu_control_point.opcode, length);

    if (dfu_control_point.opcode >= DFU_OPCODE_MAX || dfu_control_point.opcode <= DFU_OPCODE_MIN)
    {
        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = dfu_control_point.opcode;
        notif_data[2] = 0xff;
        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    switch (dfu_control_point.opcode)
    {
    case DFU_OPCODE_START_DFU: //0x01
        if (length == DFU_LENGTH_START_DFU)/*4 bytes is padding for encrypt*/
        {
            if (OTP->ota_with_encryption_data)
            {
                DFU_PRINT_INFO1("ctrl header before decryped=%b", TRACE_BINARY(16, p));
                dfu_hw_aes_decrypt_image(p, p, 16);
                DFU_PRINT_INFO1("ctrl header after decryped=%b", TRACE_BINARY(16, p));
            }

            dfu_control_point.start_dfu.ic_type = (*p);
            p += 1;
            dfu_control_point.start_dfu.secure_version = (*p);
            p += 1;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.ctrl_flag.value, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.start_dfu.crc16, p);
            p += 2;
            LE_ARRAY_TO_UINT32(dfu_control_point.start_dfu.payload_len, p);

            DFU_PRINT_INFO6("DFU_OPCODE_START_DFU: ic_type=0x%x, secure_version=0x%x, ctrl_flag.value=0x%x, image_id=0x%x,crc16=0x%x, payload_len=%d",
                            dfu_control_point.start_dfu.ic_type,
                            dfu_control_point.start_dfu.secure_version,
                            dfu_control_point.start_dfu.ctrl_flag.value,
                            dfu_control_point.start_dfu.image_id,
                            dfu_control_point.start_dfu.crc16,
                            dfu_control_point.start_dfu.payload_len
                           );
            g_dfu_para.ctrl_header.ic_type = dfu_control_point.start_dfu.ic_type;
            g_dfu_para.ctrl_header.ctrl_flag.value = dfu_control_point.start_dfu.ctrl_flag.value;
            g_dfu_para.ctrl_header.image_id = dfu_control_point.start_dfu.image_id;
            g_dfu_para.ctrl_header.crc16 = dfu_control_point.start_dfu.crc16;
            g_dfu_para.ctrl_header.payload_len = dfu_control_point.start_dfu.payload_len;
            g_dfu_para.image_total_length = g_dfu_para.ctrl_header.payload_len + IMG_HEADER_SIZE;

            /*check if start dfu fileds are vaild*/
            if (g_dfu_para.ctrl_header.ic_type == DEFINED_IC_TYPE)
            {
                if (((g_dfu_para.ctrl_header.image_id >= OTA) && (g_dfu_para.ctrl_header.image_id < IMAGE_MAX))
                    || (g_dfu_para.ctrl_header.image_id == IMAGE_USER_DATA))
                {
                    /*disable bank switch, need record temp image info*/
                    if (!is_ota_support_bank_switch())
                    {
                        temp_image_info[temp_image_num].image_id = (T_IMG_ID)g_dfu_para.ctrl_header.image_id;
//                        temp_image_info[temp_image_num].image_size = UP_ALIGN(g_dfu_para.image_total_length, FMC_SEC_SECTION_LEN);
                        temp_image_info[temp_image_num].image_size = g_dfu_para.image_total_length;
                        if (temp_image_num == 0)
                        {
                            temp_image_info[temp_image_num].image_offset = 0;
                        }
                        else
                        {
                            temp_image_info[temp_image_num].image_offset = temp_image_info[temp_image_num - 1].image_offset +
                                                                           temp_image_info[temp_image_num - 1].image_size;
                        }
                    }
                    DFU_PRINT_INFO4("DFU_OPCODE_START_DFU: image_num=%d, image_id=0x%x, image_size=0x%x, image_offset=0x%x",
                                    temp_image_num, temp_image_info[temp_image_num].image_id,
                                    temp_image_info[temp_image_num].image_size, temp_image_info[temp_image_num].image_offset);

                    callback_data.msg_data.write.opcode = DFU_WRITE_START;
                    callback_data.msg_data.write.length = DFU_HEADER_SIZE;
                    callback_data.msg_data.write.p_value = (uint8_t *)&g_dfu_para.ctrl_header;
                    if (pfn_dfu_service_cb)
                    {
                        w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                        if (w_cause != APP_RESULT_SUCCESS)
                        {
                            return;
                        }
                    }

                    uint32_t result = dfu_update(g_dfu_para.ctrl_header.image_id,
                                                 0 + temp_image_info[temp_image_num].image_offset, DFU_HEADER_SIZE,
                                                 (uint32_t *)&g_dfu_para.ctrl_header, true);
                    if (result)
                    {
                        DBG_DIRECT("DFU_OPCODE_START_DFU: dfu_update fail=%d", result);
                        T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_UPDATE_FLASH;
                        callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;
                        callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
                        callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;
                        if (pfn_dfu_service_cb)
                        {
                            w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                            if (w_cause != APP_RESULT_SUCCESS)
                            {
                                return;
                            }
                        }

                        dfu_fw_reboot(false);
                    }
                    else
                    {
                        g_dfu_para.cur_offset += DFU_HEADER_SIZE;
                        DFU_PRINT_INFO0("DFU_OPCODE_START_DFU: start success!");

