shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/ble/profile/server/dfu_service.c
                        uint32_t updated_success_len = DFU_HEADER_SIZE;
                        callback_data.msg_data.write.opcode = DFU_WRITE_DOING;
                        callback_data.msg_data.write.length = 4;
                        callback_data.msg_data.write.p_value = (uint8_t *)&updated_success_len;
                        if (pfn_dfu_service_cb)
                        {
                            w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                            if (w_cause != APP_RESULT_SUCCESS)
                            {
                                return;
                            }
                        }

                        notif_data[0] = DFU_OPCODE_NOTIFICATION;
                        notif_data[1] = DFU_OPCODE_START_DFU;
                        notif_data[2] = DFU_ARV_SUCCESS;
                        server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                         notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
                    }


                }
                else
                {
                    DFU_PRINT_ERROR1("DFU_OPCODE_START_DFU: image id=0x%x Error!", g_dfu_para.ctrl_header.image_id);
                    notif_data[0] = DFU_OPCODE_NOTIFICATION;
                    notif_data[1] = DFU_OPCODE_START_DFU;
                    notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                    server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                     notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
                    return;
                }
            }
            else
            {
                DFU_PRINT_ERROR1("DFU_OPCODE_START_DFU: ic type=0x%x Error!", g_dfu_para.ctrl_header.ic_type);
                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_START_DFU;
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, DFU_NOTIFY_LENGTH_START_DFU, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }
        }
        break;

    case DFU_OPCODE_RECEIVE_FW_IMAGE_INFO://0x02
        if (length == DFU_LENGTH_RECEIVE_FW_IMAGE_INFO)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            p += 2;
            LE_ARRAY_TO_UINT32(g_dfu_para.cur_offset, p);
            if ((g_dfu_para.cur_offset == 0) || (g_dfu_para.cur_offset == DFU_HEADER_SIZE))
            {
                g_ota_tmp_buf_used_size = 0;
                dfu_resend_offset = 0;
            }
            DFU_PRINT_INFO3("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: image_id=0x%x, cur_offset=%d, g_ota_tmp_buf_used_size=%d",
                            g_dfu_para.ctrl_header.image_id, g_dfu_para.cur_offset, g_ota_tmp_buf_used_size);
        }
        else
        {
            DFU_PRINT_ERROR1("DFU_OPCODE_RECEIVE_FW_IMAGE_INFO: length=%d Error!", length);
        }
        break;

    case DFU_OPCODE_VALID_FW://0x03

        if (length == DFU_LENGTH_VALID_FW)
        {
            LE_ARRAY_TO_UINT16(g_dfu_para.ctrl_header.image_id, p);
            DFU_PRINT_TRACE1("DFU_OPCODE_VALID_FW: image_id=0x%x", g_dfu_para.ctrl_header.image_id);

            /*if ota large img, need modify wdg timeout period*/
            if (OTP->wdgEnableInRom && g_dfu_para.image_total_length > 0x100000)
            {
                /*1M and less---4s, 2M and less---8s,..., 8M and less---32s*/
                uint32_t img_align_len = ((g_dfu_para.image_total_length + (0x100000 - 1)) & (~(0x100000 - 1)));
                uint8_t wdg_period_4s = (img_align_len / 0x100000);
                uint16_t div_factor = (32 * wdg_period_4s - 1);
                DFU_PRINT_TRACE2("DFU_OPCODE_VALID_FW: Change WDG Period to %ds, div_factor=%d", wdg_period_4s << 2,
                                 div_factor);
                WDG_Config(div_factor, 15, RESET_ALL); //31 - 4s, 63 - 8s
            }
            /*It is not recommended to do things that take a long time in upperstack task cb.
                So dfu service cb need send msg to app task to handle checksum image if support silent ota.
                While app task must handle IO_MSG_TYPE_DFU_VALID_FW by calling dfu_service_handle_valid_fw.
            */
        }
        else
        {
            DFU_PRINT_ERROR1("DFU_OPCODE_VALID_FW: length=%d Error!", length);
        }
        break;

    case DFU_OPCODE_ACTIVE_IMAGE_RESET://0x04
        {
            /*when disable bank switch, need set image ready*/
            dfu_service_handle_active_image();

            /*notify bootloader to reset and use new image*/
            DFU_PRINT_INFO0("DFU_OPCODE_ACTIVE_IMAGE_RESET");
            callback_data.msg_data.write.opcode = DFU_WRITE_END;
            callback_data.msg_data.write.length = DFU_HEADER_SIZE;
            callback_data.msg_data.write.p_value = (uint8_t *)&g_dfu_para.ctrl_header;
            if (pfn_dfu_service_cb)
            {
                w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                if (w_cause != APP_RESULT_SUCCESS)
                {
                    return;
                }
            }

            if (!is_ota_support_bank_switch())
            {
                /*note: must unlock flash bp for ota copy before reset when not support bank switch*/
                unlock_flash_bp_all();
            }
        }
        break;

    case DFU_OPCODE_SYSTEM_RESET://0x05
        {
            /*whatever cause ota fail, clinet will send this cmd to reset device*/
            DBG_DIRECT("DFU_OPCODE_SYSTEM_RESET");

            /*if select not active image by Phone even if image transport successful. Not for single bank user data*/
            if (g_dfu_para.ctrl_header.image_id >= OTA && g_dfu_para.ctrl_header.image_id < IMAGE_MAX)
            {

