shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/ble/profile/server/dfu_service.c
            notif_data[0] = DFU_OPCODE_NOTIFICATION;
            notif_data[1] = DFU_OPCODE_COPY_IMG;

            if (dfu_copy_img(g_dfu_para.ctrl_header.image_id, dlAddress, dlSize))
            {
                notif_data[2] = DFU_ARV_SUCCESS;
            }
            else
            {
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
            }
            server_send_data(conn_id, dfu_service_id, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, DFU_NOTIFY_LENGTH_ARV, GATT_PDU_TYPE_NOTIFICATION);
        }
        break;
#endif  //end ENABLE_BANK_SWITCH_COPY_APP_DATA

    default:
        {
            DFU_PRINT_TRACE1("dfu_service_handle_control_point_req: Unknown Opcode=0x%x",
                             dfu_control_point.opcode);
        }
        break;
    }
}


/**
 * @brief dfu_service_handle_packet_req
 *
 * @param length     data reviewed length.
 * @param p_value    data receive point address.
 * @return None
*/
void dfu_service_handle_packet_req(uint8_t conn_id, uint16_t length, uint8_t *p_value)
{
    T_APP_RESULT w_cause = APP_RESULT_SUCCESS;
    T_DFU_CALLBACK_DATA callback_data;
    callback_data.conn_id = conn_id;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE;
    callback_data.msg_data.write.write_attrib_index = INDEX_DFU_PACKET_VALUE;
    callback_data.msg_data.write.length = length;
    callback_data.msg_data.write.p_value = p_value;

    DFU_PRINT_INFO4("dfu_service_handle_packet_req: length=%d, cur_offset=%d, g_ota_tmp_buf_used_size=%d, image_total_length=%d",
                    length, g_dfu_para.cur_offset,
                    g_ota_tmp_buf_used_size, g_dfu_para.image_total_length);

    if (buffer_check_en == true)
    {
        /*to avoid memory overflow*/
        if (g_ota_tmp_buf_used_size + length > DFU_TEMP_BUFFER_SIZE)
        {
            DFU_PRINT_ERROR3("<==dfu_service_handle_packet_req: Buf overflow! ota_tmp_buf_used_size=%d,length=%d, max_buffer_size=%d",
                             g_ota_tmp_buf_used_size, length, DFU_TEMP_BUFFER_SIZE);

            T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_EXCEED_MAX_BUFFER_SIZE;
            callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
            callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;
            callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;
            if (pfn_dfu_service_cb)
            {
                w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                if (w_cause != APP_RESULT_SUCCESS)
                {
                    return;
                }
            }

            dfu_fw_reboot(false);
        }
        else
        {
            memcpy(p_ota_temp_buffer_head + g_ota_tmp_buf_used_size, p_value, length);
            g_ota_tmp_buf_used_size += length;
        }
    }
    else
    {
        /*when disable buffer check, Default client send 20bytes per packet*/
        uint32_t max_buffer_size = DFU_TEMP_BUFFER_SIZE - (DFU_TEMP_BUFFER_SIZE % 20);
        /*0.check memcpy buffer boundary*/
        if (g_ota_tmp_buf_used_size + length > max_buffer_size)
        {
            DBG_DIRECT("<==dfu_service_handle_packet_req: Buf overflow! ota_tmp_buf_used_size=%d,length=%d, max_buffer_size=%d",
                       g_ota_tmp_buf_used_size, length, max_buffer_size);

            T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_EXCEED_MAX_BUFFER_SIZE;
            callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;
            callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
            callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;
            if (pfn_dfu_service_cb)
            {
                w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                if (w_cause != APP_RESULT_SUCCESS)
                {
                    return;
                }
            }

            dfu_fw_reboot(false);
        }

        /*0.check total length*/
        if (g_dfu_para.cur_offset + g_ota_tmp_buf_used_size + length > g_dfu_para.image_total_length)
        {
            DFU_PRINT_ERROR1("<==dfu_service_handle_packet_req: received data total length beyond image_total_length(%d bytes)",
                             g_dfu_para.image_total_length);

            T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_EXCEED_IMG_TOTAL_LEN;
            callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;
            callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
            callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;
            if (pfn_dfu_service_cb)
            {
                w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                if (w_cause != APP_RESULT_SUCCESS)
                {
                    return;
                }
            }

            dfu_fw_reboot(false);
        }

        /*start handle received data*/
        //1. deceypt data
        if (OTP->ota_with_encryption_data)
        {
            dfu_hw_aes_decrypt_image(p_value, p_value, length);
        }

        //2. copy received data to buffer
        memcpy(p_ota_temp_buffer_head + g_ota_tmp_buf_used_size, p_value, length);
        g_ota_tmp_buf_used_size += length;

        //3. write to flash
        if (g_ota_tmp_buf_used_size == max_buffer_size ||
            g_dfu_para.cur_offset + g_ota_tmp_buf_used_size == g_dfu_para.image_total_length)
        {
            uint32_t result = dfu_update(g_dfu_para.ctrl_header.image_id,
                                         g_dfu_para.cur_offset + temp_image_info[temp_image_num].image_offset,
                                         g_ota_tmp_buf_used_size,
                                         (uint32_t *)p_ota_temp_buffer_head, false);
            if (result)
            {
                DBG_DIRECT("Buffer check disable: dfu_update fail=%d", result);

                /*eflash write fail, we should restart ota procedure.*/
                T_DFU_FAIL_REASON dfu_fail_reason = DFU_FAIL_UPDATE_FLASH;
                callback_data.msg_data.write.opcode = DFU_WRITE_FAIL;
                callback_data.msg_data.write.length = sizeof(T_DFU_FAIL_REASON);
                callback_data.msg_data.write.p_value = (uint8_t *)&dfu_fail_reason;
                if (pfn_dfu_service_cb)
                {
                    w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                    if (w_cause != APP_RESULT_SUCCESS)
                    {
                        return;
                    }
                }

                dfu_fw_reboot(false);
            }
            else
            {
                uint32_t updated_success_len = g_ota_tmp_buf_used_size;
                callback_data.msg_data.write.opcode = DFU_WRITE_DOING;
                callback_data.msg_data.write.length = 4;
                callback_data.msg_data.write.p_value = (uint8_t *)&updated_success_len;
                if (pfn_dfu_service_cb)
                {
                    w_cause = pfn_dfu_service_cb(dfu_service_id, (void *)&callback_data);
                    if (w_cause != APP_RESULT_SUCCESS)
                    {
                        return;
                    }
                }

